docs/assign.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-12 Mon 20:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>SWE 619 Assignments</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="alternative stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignments</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#a1">Assignment 1</a>
<ul>
<li><a href="#org0f448f8">Goals</a></li>
<li><a href="#org47e2b80">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a2">Assignment 2</a>
<ul>
<li><a href="#org303052c">Goals: Contracts</a></li>
<li><a href="#org201521d">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a3">Assignment 3</a>
<ul>
<li><a href="#org3cb8eaf">Goals: Data Abstraction / Mutability</a></li>
<li><a href="#orgeeffa73">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a4">Assignment 4</a>
<ul>
<li><a href="#orgd34f288">Goals: Rep-Invariants, contracts, tests</a></li>
<li><a href="#org0b92426">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a5">Assignment 5</a>
<ul>
<li><a href="#org4ef9198">Goals: Immutablity via Bloch Item 50</a></li>
<li><a href="#org53baa66">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a6">Assignment 6</a>
<ul>
<li><a href="#org8a79c17">Goals: Type Abstraction</a></li>
<li><a href="#orgb31c57c">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a7">Assignment 7</a>
<ul>
<li><a href="#org9f3d9f0">Goals: Polymorphic Abstraction.</a></li>
<li><a href="#org28fab95">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a8">Assignment 8</a>
<ul>
<li><a href="#orgd9288f0">Goals: Generics</a></li>
<li><a href="#org7edc45f">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a9">Assignment 9</a>
<ul>
<li><a href="#org611a8ef">Goals: <code>Object</code> class contracts.</a></li>
<li><a href="#orgfdc4296">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a10">Assignment 10</a>
<ul>
<li><a href="#orgc03e9b4">Goals: Favoring composition over inheritance. Bloch, Item 18.</a></li>
<li><a href="#org639e151">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#a11">Assignment 11</a>
<ul>
<li><a href="#org0207d9c">Goals: Applying lessons learned.</a></li>
<li><a href="#org8894ee2">Grading Criteria</a></li>
</ul>
</li>
<li><a href="#org047bf8c">Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3aa382d" class="outline-2">
<h2 id="a1">Assignment 1</h2>
<div class="outline-text-2" id="text-a1">
</div>

<div id="outline-container-org0f448f8" class="outline-3">
<h3 id="org0f448f8">Goals</h3>
<div class="outline-text-3" id="text-org0f448f8">
<ul class="org-ul">
<li>Getting started on Piazza.</li>
<li>Getting your group together.</li>
</ul>

<p>
There are two parts to this assignment:
</p>

<ul class="org-ul">
<li>Post a brief intro about yourself on the course Piazza page. For any credit, the posting must:
<ul class="org-ul">
<li>be a follow-up to my introduction. In other words, all intros need to be in the same thread.</li>
<li>Include a photo appropriate in size, content, and orientation.</li>
</ul></li>
<li>Your <b>group</b> should communicate the composition of your group to me (and the GTA) on Piazza. If you group is sticking with the random assignment, just confirm that. If you have a new group, tell us the composition, and we'll edit the post to reflect the change.</li>
</ul>
</div>
</div>

<div id="outline-container-org47e2b80" class="outline-3">
<h3 id="org47e2b80">Grading Criteria</h3>
<div class="outline-text-3" id="text-org47e2b80">
<ul class="org-ul">
<li>Your individual Piazza post adhers to my instructions. (That is, no sideways pictures, no oversize pictures, etc.)</li>
<li>You are in a group.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org3adbec1" class="outline-2">
<h2 id="a2">Assignment 2</h2>
<div class="outline-text-2" id="text-a2">
</div>

<div id="outline-container-org303052c" class="outline-3">
<h3 id="org303052c">Goals: Contracts</h3>
<div class="outline-text-3" id="text-org303052c">
<p>
For the second assignment, you'll build a <i>very</i> small piece of Java for a contract with preconditions, transform the contract so that all preconditions become postconditions, and then re-implement appropriately.
</p>

<p>
Consider a method that calculates the number of months needed to pay off a loan of a given size at a fixed <i>annual</i> interest rate and a fixed <i>monthly</i> payment. For instance, a $100,000 loan at an 8% annual rate would take 166 months to discharge at a monthly payment of $1,000, and 141 months to discharge at a monthly payment of $1,100. (In both of these cases, the final payment is smaller than the others; I rounded 165.34 up to 166 and 140.20 up to 141.) Continuing the example, the loan would never be paid off at a monthly payment of $100, since the principal would grow rather than shrink.
</p>

<p>
Define a Java class called <code>Loan</code>. In that class, write a method that satisfies the following specification:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6c71c4; font-weight: bold;">@param</span> principal:  Amount of the initial principal
<span style="color: #6c71c4; font-weight: bold;">@param</span> rate:       Annual interest rate  (8% rate expressed as rate = 0.08)
<span style="color: #6c71c4; font-weight: bold;">@param</span> payment:    Amount of the monthly payment

<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900; font-style: italic;">int</span> months (<span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">principal</span>, <span style="color: #b58900; font-style: italic;">double</span> <span style="color: #268bd2;">rate</span>, <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">payment</span>)

Requires: principal, rate, and payment all positive 
         and payment is sufficiently large to drive the principal <span style="color: #b58900; font-style: italic;">to</span> <span style="color: #6c71c4; font-weight: bold;">zero</span>.
<span style="color: #268bd2;">Effects</span>:  <span style="color: #859900; font-weight: bold;">return</span> the number of months required to pay off the principal
</pre>
</div>


<p>
Note that the precondition is quite strong, which makes implementing the method easy. You should use double precision arithmetic internally, but the final result is an integer, not a floating point value. The key step in your calculation is to change the principal on each iteration with the following formula (which amounts to monthly compounding):
</p>

<div class="org-src-container">
<pre class="src src-java">newPrincipal = oldPrincipal * (1 + monthlyInterestRate) - payment;
</pre>
</div>


<p>
The variable names here are explanatory, not required. You may want to use different variables, which is fine.
</p>

<p>
<b>To make sure you understand the point about preconditions, your code is required to be minimal. Specifically, if it possible to delete parts of your implementation and still have it satisfy the requirements, you'll earn less than full credit.</b>
</p>

<p>
Now modify <code>months</code> so that it handles <b>all</b> of its preconditions with exceptions. Use the standard exceptions recommended by Bloch. Document this with a revised contract. You can use JavaDoc or you can simply identify the postconditions.
</p>
</div>
</div>

<div id="outline-container-org201521d" class="outline-3">
<h3 id="org201521d">Grading Criteria</h3>
<div class="outline-text-3" id="text-org201521d">
<ul class="org-ul">
<li>Adherence to instructions.</li>
<li>Minimal implementation.</li>
<li>Preconditions are correctly converted to exceptions.</li>
<li>Syntax: Java compiles and runs.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org10dad50" class="outline-2">
<h2 id="a3">Assignment 3</h2>
<div class="outline-text-2" id="text-a3">
</div>
<div id="outline-container-org3cb8eaf" class="outline-3">
<h3 id="org3cb8eaf">Goals: Data Abstraction / Mutability</h3>
<div class="outline-text-3" id="text-org3cb8eaf">
<p>
Rewrite <a href="./files/MapPoly.java">MapPoly</a>, my map-based version Liskov's Poly so that it is <i>mutable</i>. Keep the same representation.
</p>

<p>
Rewrite the overview, the method signatures, the method specifications, and the methods themselves. You do not need to rewrite the abstraction function and representation invariant for this exercise.
</p>

<p>
Turn in a <b>story</b>. This means that it is possible to grade your assignment simply by reading it, as if it were part of a textbook. In particular, every place you make a decision to change something in the code (or not), you should have a description of what you did (or didn't do) and why you did (or didn't do) it.
</p>

<p>
Remember that part of your group is responsible for synthesizing a solution, and part of your group is responsible for checking the result.
</p>
</div>
</div>

<div id="outline-container-orgeeffa73" class="outline-3">
<h3 id="orgeeffa73">Grading Criteria</h3>
<div class="outline-text-3" id="text-orgeeffa73">
<ul class="org-ul">
<li>Correct transformation of Poly</li>
<li>Clarity of your story.</li>
<li>Reasonable division of synthesis vs. checking.</li>
</ul>
</div>
</div>
</div>
