docs/assign.org
** Goals: Rep-Invariants, contracts, tests
  
  Revisit the mutable Poly example from [[./assign03.html][assignment 3]]. That is, use the one based on a map, not an array.
  
  1. Implement =repOk()=.
  1. Introduce a fault (i.e. "bug") that breaks the rep-invariant. Try to do this with a small (conceptual) change to the code. Show that the rep-invariant is broken with a JUnit test.
  1. Analyzed your bug with respect to the various contracts/methods in Poly. Are all/some/none of the contracts violated?
  1. Do you think your fault is realistic? Why or why not?

  As in assignment 3, your deliverable is a *story*, with exactly the same rationale. Take screenshots (e.g. of failing JUnit tests) as necessary to make your case.

** Grading Criteria
  
  - Correctness of solution
  - Clarity of story
Note: If your group had trouble with the previous assignment, feel free to appeal to your classmates to post a sample solution on Piazza.


* Assignment 5 

#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">

** Goals: Immutablity via Bloch Item 50

  Revisit the Period example [[./inclass04B.html][In-Class 4B]].

  Implement a satisfying solution to question 3. That is, you should not only break the immutability of the =Period= class by writing a suitable sublcass, but you should also develop a plausible case where a client ends up "in trouble" due to the loss of immutability.

  Turn in a *story*.

** Grading Criteria

  Grading is in part the technical aspect of breaking immutability, and in part that your client case is plausible.


* Assignment 6 

#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">

** Goals: Type Abstraction

  Consider the following =Market= class.
  
  #+begin_src java

    class Market {
       private Set<Item> wanted;           // items for which prices are of interest
       private Bag<Item, Money> offers;    // offers to sell items at specific prices
       // Note:  Bag isn't a Java data type.  Here, the bag entries are pairs.

       public void offer (Item item, Money price)
          // Requires: item is an element of wanted
          // Effects:  add (item, price) to offers
   
       public Money buy(Item item)
          // Requires: item is an element of the domain of offers
          // Effects: choose and remove some (arbitrary) pair (item, price) from
          //          offers and return the chosen price
    }

  #+end_src

  1. Suppose that offers are only accepted if they are lower than previous offers.
     #+begin_src java
       class Low_Bid_Market extends Market {
          public void offer (Item item, Money price)
             // Requires: item is an element of wanted
             // Effects:  if (item, price) is not cheaper than any existing pair
             //           (item, existing_price) in offers do nothing
             //           else add (item, price) to offers

     #+end_src
     Is =Low_Bid_Market= a valid subtype of =Market=? Appeal to the methods rule to back up your answer.
     
  1. Suppose that the =buy()= method always chooses the lowest price on an item.
     #+begin_src java
       class Low_Offer_Market extends Market {
              public Money buy(Item item)
                 // Requires: item is an element the domain of offers
                 // Effects: choose and remove pair (item, price) with the 
                 //          lowest price from offers and return the chosen price
     #+end_src
     Is =Low_Offer_Market= a valid subtype of =Market=? Appeal to the methods rule to back up your answer. 


** Grading Criteria

  This is purely a "paper and pencil" exercise. No code is required. Write your answer so that it is easily understandable by someone with only a passing knowledge of Liskov's rules for subtypes.


* Assignment 7 

#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">

** Goals: Polymorphic Abstraction.

A =Comparator= based on absolute values is problematic. Code up the comparator and then write client code that illustrates the problem. Use a /lambda function/ to implement the comparator. Explain what is wrong in a brief summary statement. Your explanation of the problem must be phrased in terms of a violation of the contract for =Comparator=.

To emphasize that this contract problem is real, your code should create two Java sets, one a =HashSet=, and the other a =TreeSet=. The =TreeSet= should order items with your absolute value comparator. Your example should add the same integers to both sets, yet still end up with sets that are different. Your summary statement should explain why.

** Grading Criteria
  As for other recent assignments, your deliverable is a clear, concise story that demonstrates completion of the assignment.

* Assignment 8 

#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">

