docs/assign.html


<div id="outline-container-orgd5c0473" class="outline-2">
<h2 id="a4">Assignment 4</h2>
<div class="outline-text-2" id="text-a4">
</div>
<div id="outline-container-orgd34f288" class="outline-3">
<h3 id="orgd34f288">Goals: Rep-Invariants, contracts, tests</h3>
<div class="outline-text-3" id="text-orgd34f288">
<p>
Revisit the mutable Poly example from <a href="./assign03.html">assignment 3</a>. That is, use the one based on a map, not an array.
</p>

<ol class="org-ol">
<li>Implement <code>repOk()</code>.</li>
<li>Introduce a fault (i.e. "bug") that breaks the rep-invariant. Try to do this with a small (conceptual) change to the code. Show that the rep-invariant is broken with a JUnit test.</li>
<li>Analyzed your bug with respect to the various contracts/methods in Poly. Are all/some/none of the contracts violated?</li>
<li>Do you think your fault is realistic? Why or why not?</li>
</ol>

<p>
As in assignment 3, your deliverable is a <b>story</b>, with exactly the same rationale. Take screenshots (e.g. of failing JUnit tests) as necessary to make your case.
</p>
</div>
</div>

<div id="outline-container-org0b92426" class="outline-3">
<h3 id="org0b92426">Grading Criteria</h3>
<div class="outline-text-3" id="text-org0b92426">
<ul class="org-ul">
<li>Correctness of solution</li>
<li>Clarity of story</li>
</ul>
<p>
Note: If your group had trouble with the previous assignment, feel free to appeal to your classmates to post a sample solution on Piazza.
</p>
</div>
</div>
</div>


<div id="outline-container-orgb3a66fc" class="outline-2">
<h2 id="a5">Assignment 5</h2>
<div class="outline-text-2" id="text-a5">
</div>
<div id="outline-container-org4ef9198" class="outline-3">
<h3 id="org4ef9198">Goals: Immutablity via Bloch Item 50</h3>
<div class="outline-text-3" id="text-org4ef9198">
<p>
Revisit the Period example <a href="./inclass04B.html">In-Class 4B</a>.
</p>

<p>
Implement a satisfying solution to question 3. That is, you should not only break the immutability of the <code>Period</code> class by writing a suitable sublcass, but you should also develop a plausible case where a client ends up "in trouble" due to the loss of immutability.
</p>

<p>
Turn in a <b>story</b>.
</p>
</div>
</div>

<div id="outline-container-org53baa66" class="outline-3">
<h3 id="org53baa66">Grading Criteria</h3>
<div class="outline-text-3" id="text-org53baa66">
<p>
Grading is in part the technical aspect of breaking immutability, and in part that your client case is plausible.
</p>
</div>
</div>
</div>


<div id="outline-container-orgfcec486" class="outline-2">
<h2 id="a6">Assignment 6</h2>
<div class="outline-text-2" id="text-a6">
</div>

<div id="outline-container-org8a79c17" class="outline-3">
<h3 id="org8a79c17">Goals: Type Abstraction</h3>
<div class="outline-text-3" id="text-org8a79c17">
<p>
Consider the following <code>Market</code> class.
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Market</span> {
   <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">Item</span>&gt; <span style="color: #268bd2;">wanted</span>;           <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">items for which prices are of interest</span>
   <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">Bag</span>&lt;<span style="color: #b58900; font-style: italic;">Item</span>, <span style="color: #b58900; font-style: italic;">Money</span>&gt; <span style="color: #268bd2;">offers</span>;    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">offers to sell items at specific prices</span>
   <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Note:  Bag isn't a Java data type.  Here, the bag entries are pairs.</span>

   <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">offer</span> (<span style="color: #b58900; font-style: italic;">Item</span> <span style="color: #268bd2;">item</span>, <span style="color: #b58900; font-style: italic;">Money</span> <span style="color: #268bd2;">price</span>)
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Requires: item is an element of wanted</span>
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects:  add (item, price) to offers</span>

   <span style="color: #859900; font-weight: bold;">public</span> Money buy(<span style="color: #b58900; font-style: italic;">Item</span> <span style="color: #268bd2;">item</span>)
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Requires: item is an element of the domain of offers</span>
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects: choose and remove some (arbitrary) pair (item, price) from</span>
      <span style="color: #96A7A9; font-style: italic;">//          </span><span style="color: #96A7A9; font-style: italic;">offers and return the chosen price</span>
}

</pre>
</div>

<ol class="org-ol">
<li><p>
Suppose that offers are only accepted if they are lower than previous offers.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Low_Bid_Market</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Market</span> {
   <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">offer</span> (<span style="color: #b58900; font-style: italic;">Item</span> <span style="color: #268bd2;">item</span>, <span style="color: #b58900; font-style: italic;">Money</span> <span style="color: #268bd2;">price</span>)
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Requires: item is an element of wanted</span>
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects:  if (item, price) is not cheaper than any existing pair</span>
      <span style="color: #96A7A9; font-style: italic;">//           </span><span style="color: #96A7A9; font-style: italic;">(item, existing_price) in offers do nothing</span>
      <span style="color: #96A7A9; font-style: italic;">//           </span><span style="color: #96A7A9; font-style: italic;">else add (item, price) to offers</span>

</pre>
</div>
<p>
Is <code>Low_Bid_Market</code> a valid subtype of <code>Market</code>? Appeal to the methods rule to back up your answer.
</p></li>

<li><p>
Suppose that the <code>buy()</code> method always chooses the lowest price on an item.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Low_Offer_Market</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Market</span> {
       <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">Money</span> <span style="color: #b58900;">buy</span>(<span style="color: #b58900; font-style: italic;">Item</span> <span style="color: #268bd2;">item</span>)
          <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Requires: item is an element the domain of offers</span>
          <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects: choose and remove pair (item, price) with the </span>
          <span style="color: #96A7A9; font-style: italic;">//          </span><span style="color: #96A7A9; font-style: italic;">lowest price from offers and return the chosen price</span>
</pre>
</div>
<p>
Is <code>Low_Offer_Market</code> a valid subtype of <code>Market</code>? Appeal to the methods rule to back up your answer. 
</p></li>
</ol>
</div>
</div>


<div id="outline-container-orgb31c57c" class="outline-3">
<h3 id="orgb31c57c">Grading Criteria</h3>
<div class="outline-text-3" id="text-orgb31c57c">
<p>
This is purely a "paper and pencil" exercise. No code is required. Write your answer so that it is easily understandable by someone with only a passing knowledge of Liskov's rules for subtypes.
</p>
</div>
</div>
</div>


<div id="outline-container-org4d52a71" class="outline-2">
<h2 id="a7">Assignment 7</h2>
<div class="outline-text-2" id="text-a7">
</div>

<div id="outline-container-org9f3d9f0" class="outline-3">
<h3 id="org9f3d9f0">Goals: Polymorphic Abstraction.</h3>
<div class="outline-text-3" id="text-org9f3d9f0">
<p>
A <code>Comparator</code> based on absolute values is problematic. Code up the comparator and then write client code that illustrates the problem. Use a <i>lambda function</i> to implement the comparator. Explain what is wrong in a brief summary statement. Your explanation of the problem must be phrased in terms of a violation of the contract for <code>Comparator</code>.
</p>

<p>
To emphasize that this contract problem is real, your code should create two Java sets, one a <code>HashSet</code>, and the other a <code>TreeSet</code>. The <code>TreeSet</code> should order items with your absolute value comparator. Your example should add the same integers to both sets, yet still end up with sets that are different. Your summary statement should explain why.
</p>
</div>
</div>

<div id="outline-container-org28fab95" class="outline-3">
<h3 id="org28fab95">Grading Criteria</h3>
<div class="outline-text-3" id="text-org28fab95">
<p>
As for other recent assignments, your deliverable is a clear, concise story that demonstrates completion of the assignment.
</p>
</div>
</div>
</div>
