docs/assign.html


<div id="outline-container-org9c2926b" class="outline-2">
<h2 id="a8">Assignment 8</h2>
<div class="outline-text-2" id="text-a8">
</div>

<div id="outline-container-orgd9288f0" class="outline-3">
<h3 id="orgd9288f0">Goals: Generics</h3>
<div class="outline-text-3" id="text-orgd9288f0">
<p>
Consider the <a href="./files/BoundedQueue.java">BoundedQueue</a> example from in-class exercise <a href="./inclass08C.html">#8C</a>.
</p>

<p>
Complete the generic part of the exercise: The result should be fully generic, and there should not be any compiler warnings. You should adopt Bloch's advice about lists vs. arrays; doing so will eliminate the need for many of the instance variables.
</p>

<p>
Keep the same methods, but update the behavior (and document with contracts!) to include exception handling for all cases not on the happy path.
</p>

<p>
Include the constructor in your considerations. In particular, consider whether you think a zero-sized buffer is a reasonable possibility. Document your reasoning. This is less about a right vs. wrong answer than a careful consideration of the consequences of the decision.
</p>

<p>
Add <code>putAll()</code> and <code>getAll()</code>. Define the method signatures carefully. Use exception-handling consistent with that for <code>get()</code> and <code>put()</code>. Use bounded wildcards as appropriate. Note that <code>putAll()</code> has a special case where there isn't sufficient space in the bounded queue. Adopt a solution you think Bloch and/or Liskov would approve of. In particular, Bloch prefers that when methods throw exceptions, there is no change to the state of the object.
</p>
</div>
</div>

<div id="outline-container-org7edc45f" class="outline-3">
<h3 id="org7edc45f">Grading Criteria</h3>
<div class="outline-text-3" id="text-org7edc45f">
<p>
As before, turn in a clear, concise story demonstrating completion of the assignment.
</p>
</div>
</div>
</div>


<div id="outline-container-org1397412" class="outline-2">
<h2 id="a9">Assignment 9</h2>
<div class="outline-text-2" id="text-a9">
</div>

<div id="outline-container-org611a8ef" class="outline-3">
<h3 id="org611a8ef">Goals: <code>Object</code> class contracts.</h3>
<div class="outline-text-3" id="text-org611a8ef">
<p>
As it happens, Liskov's implementation of <code>clone()</code> for the <code>IntSet</code> class (see figure 5.10, page 97) is wrong.
</p>

<ol class="org-ol">
<li>Use the <a href="./files/IntSet.java">version</a> of <code>IntSet</code> from the in-class exercise. Implement a subtype of <code>IntSet</code> to demonstrate the problem. Your solution should include appropiate executable code in the form of JUnit tests.</li>
<li>Provide a correct implementation of <code>clone()</code> for <code>IntSet</code>. Again, give appropriate JUnit tests.</li>
<li>Correctly override <code>hashCode()</code> and <code>equals()</code>. As discussed in the class exercise, the standard recipe is not appropriate in this (unusual) case.</li>
</ol>
</div>
</div>

<div id="outline-container-orgfdc4296" class="outline-3">
<h3 id="orgfdc4296">Grading Criteria</h3>
<div class="outline-text-3" id="text-orgfdc4296">
<p>
In addititon to code and tests, your deliverable is a story. Explain what is going on at each stage of the exercise. The GTA will primarily grade your story.
</p>
</div>
</div>
</div>


<div id="outline-container-org0670722" class="outline-2">
<h2 id="a10">Assignment 10</h2>
<div class="outline-text-2" id="text-a10">
</div>
<div id="outline-container-orgc03e9b4" class="outline-3">
<h3 id="orgc03e9b4">Goals: Favoring composition over inheritance. Bloch, Item 18.</h3>
<div class="outline-text-3" id="text-orgc03e9b4">
<p>
Consider the <code>InstrumentedSet</code> example from Bloch Item 18 (as well as in-class exercise <a href="./inclass10A.html">#10A</a>).
</p>
<ol class="org-ol">
<li>Replace <code>Set</code> with <code>List</code>. There is no problem with <code>equals()</code>. Why not?</li>
<li>Replace <code>Set</code> with <code>Collection</code>. Now <code>equals()</code> does not satisfy its contract.
<ul class="org-ul">
<li>Explain why there is a problem.</li>
<li>Demonstrate the problem with a suitable JUnit test.</li>
</ul></li>
</ol>
</div>
</div>



<div id="outline-container-org639e151" class="outline-3">
<h3 id="org639e151">Grading Criteria</h3>
<div class="outline-text-3" id="text-org639e151">
<p>
The GTA will look for correct responses, appropriate JUnit tests, and plausible explanations when doing the grading.
</p>
</div>
</div>
</div>


<div id="outline-container-org034fcf8" class="outline-2">
<h2 id="a11">Assignment 11</h2>
<div class="outline-text-2" id="text-a11">
</div>
<div id="outline-container-org0207d9c" class="outline-3">
<h3 id="org0207d9c">Goals: Applying lessons learned.</h3>
<div class="outline-text-3" id="text-org0207d9c">
<p>
You have a choice of possible assignments:
</p>

<ol class="org-ol">
<li>Consider one of the <code>copyOf()</code> methods in the Java <a href="https://docs.oracle.com/javase/7/docs/api/java/util/Arrays.html">Arrays</a> utility class. Bloch uses this method in his <code>Stack</code> example. Code a corresponding method in C++, changing the argument list as necessary. Provide a specification for the C++ code by translating the JavaDoc and adding preconditions as necessary. Explain what this exercise demonstrates about C++ type safety.</li>

<li><p>
For most of the semester, we have focused on design considerations for constructing software that does something we want it to do. For this last assignment, I would like students to appreciate just how vulnerable software is to malicious parties intent on attacking their software.
</p>

<p>
There are two attacks documented in Bloch's Item 88: <i>Write <code>readObject()</code> methods defensively</i>. One is called <code>BogusPeriod</code>, and the other is called <code>MutablePeriod</code>. Implement either (your choice) of these attacks (basically involves typing in code from Bloch) and verify that the attack takes place.
</p></li>

<li>A different source of security vulnerabilities in Java also involve serialization. Bloch (and others) recommend "cross-platform structured data representations" (e.g. JSON or Protocol Buffers) as safe alternatives. Develop a simple serialization example in Java and convert it into a safe alternative (probably, JSON is easier to use, since it is text-based). To make the example more interesting, use some objects types that are not directly supported.</li>

<li>Find some existing (Java) code that uses the "int enum pattern" and refactor it to use Java <code>Enums</code> instead. Identify any type-safety issue you uncover in the existing code. To make the exercise interesting, extend your enums beyond simple named-constants in one of the ways discussed by Bloch in Item 34.</li>

<li>Where appropriate, code up, as JUnit theories, constraints for classes that implement the Java <code>Comparable</code> interface. Note that there is significant overlap with the in-class exercise. Note also that the Comparable interface is generic; hence, you should use generics in your JUnit test class.</li>

<li>Gain experience with one of the property-based testing tools. I suggest a Java-based one (such as <a href="https://jqwik.net">jqwik</a>). One way to do this is work through one of the articles linked on the jqwik site.</li>
</ol>
</div>
</div>


<div id="outline-container-org8894ee2" class="outline-3">
<h3 id="org8894ee2">Grading Criteria</h3>
<div class="outline-text-3" id="text-org8894ee2">
<p>
In each case, the deliverable is a story. Write a brief report, and include enough evidence (output, screen shots, etc.) that the GTA can figure out that you actually completed the assignment.
</p>
</div>
</div>
</div>


<div id="outline-container-org047bf8c" class="outline-2">
<h2 id="org047bf8c">Links</h2>
<div class="outline-text-2" id="text-org047bf8c">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
